{
  "common": {
    "name": "growatt",
    "version": "3.2.4",
    "news": {
      "3.2.4": {
        "en": "No connection can be established password must now be transferred as MD5 hash.",
        "de": "Keine Verbindung kann hergestellt werden Passwort muss jetzt als MD5 Hash übertragen werden.",
        "ru": "Никакое соединение не может быть установлено паролем теперь должно быть передано как MD5 хэш.",
        "pt": "Nenhuma conexão pode ser estabelecida senha deve agora ser transferida como hash MD5.",
        "nl": "Geen verbinding kan worden ingesteld wachtwoord moet nu worden overgedragen als MD5 hash.",
        "fr": "Aucune connexion ne peut être établie mot de passe doit maintenant être transféré comme MD5 hachage.",
        "it": "Nessuna connessione può essere stabilita password deve ora essere trasferito come hash MD5.",
        "es": "Ninguna conexión puede establecerse contraseña debe ser transferida ahora como MD5 hash.",
        "pl": "Hasło nie może zostać ustanowione jako hasz MD5.",
        "uk": "Немає підключення може бути встановленим паролем, щоб тепер передаватися як MD5.",
        "zh-cn": "无法建立连接密码, 现在必须作为 MD5 散列传输 ."
      }
    },
    "titleLang": {
      "en": "Growatt Shine API",
      "de": "Growatt Shine API",
      "ru": "Growatt Shine API",
      "pt": "API Growatt Shine",
      "nl": "Growatt Shine API",
      "fr": "API Growatt Shine",
      "it": "Growatt Shine API",
      "es": "API Growatt Shine",
      "pl": "Growatt Shine API",
      "uk": "Growatt Shine API",
      "zh-cn": "Growatt Shine API"
    },
    "desc": {
      "en": "ioBroker Growatt Adapter to communiacte with ShineAPI",
      "de": "ioBroker Growatt Adapter zur Kommunikation mit ShineAPI",
      "ru": "Адаптер ioBroker Growatt для связи с ShineAPI",
      "pt": "Adaptador ioBroker Growatt para comunicação com ShineAPI",
      "nl": "ioBroker Growatt-adapter voor communicatie met ShineAPI",
      "fr": "ioBroker Growatt Adaptateur pour communiquer avec ShineAPI",
      "it": "Adattatore per Growatt ioBroker da comunicare con ShineAPI",
      "es": "Adaptador ioBroker Growatt para comunicarse con ShineAPI",
      "pl": "ioBroker Growatt Adapter do komunikacji z ShineAPI",
      "uk": "ioBroker Growatt адаптер для комунікації з ShineAPI",
      "zh-cn": "ioBroker Growatt适配器可与ShineAPI通信"
    },
    "authors": ["PLCHome"],
    "keywords": ["growatt", "shine", "shinephone", "shineapi", "solarenergy", "home automation", "solar power", "solar power plant", "solaranlage"],
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "platform": "Javascript/Node.js",
    "icon": "growatt.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/PLCHome/ioBroker.growatt/master/admin/growatt.png",
    "readme": "https://github.com/PLCHome/ioBroker.growatt/blob/master/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "messagebox": true,
    "tier": 3,
    "type": "energy",
    "compact": true,
    "connectionType": "cloud",
    "dataSource": "poll",
    "localLinks": { "_default": "https://server.growatt.com/" },
    "adminUI": { "config": "materialize" },
    "plugins": {
      "sentry": {
        "dsn": "https://580e0de8b3414b6caba783785eb4e240@o1143033.ingest.sentry.io/6202057"
      }
    },
    "dependencies": [
      {
        "js-controller": ">=5.0.19"
      }
    ]
  },
  "messages": [
    {
      "condition": {
        "operand": "and",
        "rules": ["oldVersion<3.2.2", "newVersion>=3.2.3"]
      },
      "title": {
        "en": "Incorrect objects were created in connection with Multiple Backflow.",
        "de": "Falsche Objekte wurden in Verbindung mit Multiple Backflow erstellt.",
        "ru": "Неправильные объекты были созданы в связи с Множественным Backflow.",
        "pt": "Objetos incorretos foram criados em conexão com Vários Backflow.",
        "nl": "Onjuiste objecten zijn gemaakt in verband met Multiple Backflow.",
        "fr": "Des objets incorrects ont été créés en liaison avec Multiple Backflow.",
        "it": "Oggetti non corretti sono stati creati in connessione con Multiple Backflow.",
        "es": "Se crearon objetos incorrectos en conexión con Multiple Backflow.",
        "pl": "Nieprawidłowe obiekty zostały utworzone w związku z Multiple Backflow.",
        "uk": "Некоректні об'єкти були створені у зв'язку з декількома перепадами.",
        "zh-cn": "在多个后流中创建了不正确的对象 ."
      },
      "text": {
        "en": "If you have multiple backflow objects, please delete the objects in Total Data and Status Data. The objects below Total Data and Status Data were swapped.",
        "de": "Wenn Sie mehrere Backflow-Objekte haben, löschen Sie bitte die Objekte in Total Data und Status Data. Die Objekte unter Gesamtdaten und Statusdaten wurden vertauscht.",
        "ru": "Если у вас есть несколько объектов обратного потока, пожалуйста, удалите объекты в Total Data и Status Data. Объекты ниже Total Data и Status Data были изменены.",
        "pt": "Se você tiver vários objetos de backflow, exclua os objetos em Dados totais e dados de status. Os objetos abaixo dos dados totais e dados de status foram trocados.",
        "nl": "Als u meerdere backflow objecten hebt, verwijder dan de objecten in Total Data en Status Data. De objecten hieronder Total Data en Status Data werden geruild.",
        "fr": "Si vous avez plusieurs objets backflow, veuillez supprimer les objets dans Total Data et Status Data. Les objets ci-dessous ont été échangés.",
        "it": "Se si dispone di più oggetti di backflow, si prega di eliminare gli oggetti in Dati totali e Dati di stato. Gli oggetti sottostanti Dati totali e Dati di stato sono stati scambiati.",
        "es": "Si tiene múltiples objetos de flujo de respaldo, por favor, eliminar los objetos en Datos Totales y Datos del estado. Los objetos debajo de Total Data and Status Data fueron intercambiados.",
        "pl": "Jeśli masz wiele obiektów back flow, usuń obiekty w Total Data i Status Data. Obiekty poniżej Total Data i Status Data zostały zamienione.",
        "uk": "Якщо у вас є кілька об'єктів зворотного потоку, будь ласка, видаліть об'єкти в загальній даних та даних стану. Об'єкти, які були заповнені.",
        "zh-cn": "如果您有多个回流对象,请删除全部数据和状态数据中的对象。 数据总数和状态数据下的对象已互换."
      },
      "link": "https://github.com/PLCHome/ioBroker.growatt/blob/master/README.md",
      "level": "warn",
      "linkText": {
        "en": "Documentation",
        "de": "Dokumentation",
        "ru": "Документация",
        "pt": "Documentação",
        "nl": "Document",
        "fr": "Documentation",
        "it": "Documentazione",
        "es": "Documentación",
        "pl": "Dokumentacja",
        "uk": "Документація",
        "zh-cn": "文件"
      },
      "buttons": ["agree", "cancel"]
    }
  ],
  "encryptedNative": ["password", "shareKey"],
  "protectedNative": ["password", "shareKey"],
  "native": {
    "keyLogin": false,
    "user": "",
    "password": "",
    "shareKey": "",
    "weather": true,
    "faultlog": false,
    "totalData": true,
    "historyLast": true,
    "statusData": true,
    "plantData": true,
    "deviceData": true,
    "objUpdate": {},
    "objOffset": {},
    "webTimeout": 60,
    "processTimeout": 600,
    "sessionHold": true,
    "sessionTime": 0,
    "cycleTime": 30,
    "errorCycleTime": 120,
    "growattServer": "",
    "indexCandI": false,
    "settings": false
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "If connected to Growatt Server",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}
